docs/posts/2016-07-09-prayer-for-the-nation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for the Nation</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for the Nation</h1>
<p class="subtitle" role="doc-subtitle">Jul 09, 2016</p>
</header><p>
Eternal God, you whose image lies in the hearts of all people,<br>
Hear our prayer, as we pray for our nation.
</p>

<p>
Help us to remember that you love all with your great love,<br>
that all faith is an attempt to respond to you,<br>
and that the desires of other hearts are known by you,<br>
just as our desires are known.
<br>
Lead us to use what you have given us<br>
for freedom, justice, and equality;<br>
Not only for our own sake,<br>
but for those to whom these things have been denied.
</p>

<p>
In our pride, teach us humility;<br>
In our strength, teach us grace;<br>
In our callousness, teach us compassion;<br>
In our riches, teach us generosity,<br>
In our ignorance, give us wisdom;<br>
In our fear, give us courage;<br>
In our anxiety, give us peace.
</p>

<p>
May we be a source of love in the midst of hatred,<br>
And an instrument of peace in the midst of conflict.<br>
We pray these things in the name of the most high,<br>
The source of all that is good, holy, and true.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
